<?php
	$memberData = array(
		array('博士', '謝育忠', '電遷移對純錫導線晶粒旋轉之研究', 97),
		array('碩士', '陳銘訓', '液相錫銀鉍銦無鉛銲料與銅基材反應之研究', 96),
		array('碩士', '蕭秋男', '以同步輻射臨場量測電遷移對純錫導線應力分佈之研究', 97),
		array('碩士', '孫國浩', '無鉛銲料錫銀鉍銦與銅電極之電遷移研究', 97),
		array('碩士', '丁怡真', '以表面處理及塗佈奈米粒子抑制錫晶鬚生長', 97),
		array('碩士', '楊凱雯', '鋁鍺薄膜封裝研究', 97),
		array('碩士', '蔡鈞揚', '鋁(銅)與鎳混合導線於矽通孔製程之電遷移現象研究', 98),
		array('碩士', '江昱彥', '無鉛銲料錫銀銦與銅基板的界面反應', 99),
		array('碩士', '林岱瑩', '無鉛銲料與碲化鉍基材之界面反應研究', 99),
		array('碩士', '葉昭男', '鋁鍺雙層薄膜之擴散行為與金屬誘發結晶現象研究', 99),
		array('碩士', '羅立晨', '熱電材料與擴散阻障層在電流影響下的界面反應研究', 100),
		array('碩士', '柯昌延', '錫碲擴散偶之擴散阻障層界面反應', 100),
		array('博士', '林揚益', '高摻雜之二氧化錫薄膜能隙窄化現象及氧化銦薄膜之應力量測與探討', 101),
		array('博士', '蘇建豪', '以表面處理控制自發性晶鬚生長及殘留應力對晶鬚生長動力學之影響', 102),
		array('碩士', '洪嘉宏', '無鉛銲料與添加鈀層之無電鍍鈷基材界面反應研究', 101),
		array('碩士', '簡伯因', '熱電效應對碲化鉍系統與擴散阻障層之界面反應研究', 101),
		array('碩士', '陳亭均', '無電鍍Ni-P與p型Bi0.4Sb1.6Te3材料之界面反應及熱電性質探討', 101),
		array('博士', '徐學賢', '微銲點之微結構研究與同步輻射X光量測於先進構裝之應用', 102),
		array('碩士', '林能億', '無鉛銲料與擴散阻障層於熱電材料之推力測試研究', 102),
		array('碩士', '張家豪', '共濺鍍鋁鍺薄膜之接合特性研究', 102),
		array('碩士', '黃俊皓', '無電鍍鈷基材與無鉛銲料於熱退火下之界面反應研究', 102),
		array('博士', '鄒立為', '奈米結構透明導電氧化材料之應用', 103),
		array('博士', '歐陽曜聰', '介穩態奈米結晶矽鍺薄膜之物性研究與應用', 103),
		array('博士', '黃怡婷', '微銲點受電遷移影響之界面生長機制及晶向分析', 104),
		array('碩士', '蔡宜伶', '無鉛銲料與無電鍍鈷基板於多次迴焊之界面反應與可靠度測試', 103),
		array('博士', '陳灝', '同步輻射X光量測錫膜應力對錫晶鬚生長動力學之影響', 104),
		array('博士', '林柏丞', '共濺鍍銅鈦薄膜之相分離演化機制與其對機械性質於3DIC接合的影響', 105),
		array('碩士', '李映賜', '無電鍍鎳磷層應用於熱電材料與無鉛銲料之界面研究', 104),
		array('博士', '林伯誠', '原子層沉積成長氧化物薄膜應用於氧化鋅奈米柱陣列電容器', 105),
		array('博士', '陳志豪', '新式低溫合金焊料之開發與界面反應探討及可靠度分析', 105),
		array('碩士', '黃俊哲', '銦鉍合金低溫銲料與銅基材之界面反應研究', 105),
		array('碩士', '鐘元亨', '添加微量錫銀銅合金之銅薄膜與銅基板之接合研究', 105),
		array('博士', '謝弦謙', '無電鍍鈷擴散阻障層應用於中溫碲化鉛熱電模組之研究', 106),
		array('碩士', '江政諭', '銦鉍銲料與銅基板之界面反應與接點強度測試', 106),
		array('博士', '曾讚憲', '新式抗大氣腐蝕之表面處理層開發並應用於高可靠度元件', 107),
		array('博士', '林玟志', '低溫銅燒結及定向貼附機制探討', 107),
		array('碩士', '沈怡廷', '探討電鍍與無電鍍鎳鈀金表面處理於硫氣環境之腐蝕行為與可靠度分析', 107),
		array('博士', '王峻賢', '無電鍍鈷擴散阻障層於碲化鉍熱電模組之研究', 108),
		array('碩士', '王毓謙', '碲化鉛熱電模組接點之材料研究', 108),
		array('碩士', '陳映竹', '銻化鈷薄膜熱電熱時效之研究', 108));

	for ( $i=0 ; $i<ceil(count($memberData)/4) ; $i++ ) {		
		echo '<div class="wrapper">';
	    echo '<div class="cols">';
		for ( $j=0 ; $j<4 ; $j++ ) {
			echo '<div class="col" ontouchstart="this.classList.toggle(\'hover\');">';
			echo '<div class="container">';
			echo '<div class="front" style="background-image: url(images/member/'.($i*4+$j+1).'.png)">';
			echo '<div class="inner"> <span></span></div>';
			echo '</div>';
			echo '<div class="back">';
			echo '<div class="inner">';
			echo '<p>'.$memberData[$i*4+$j][0].'</p>';
			echo '<span>第'.$memberData[$i*4+$j][3].'級</br>';
			echo '畢業論文：</br>'.$memberData[$i*4+$j][2].'</span>';
			echo '</div>';
			echo '</div>';
			echo '</div>';
			echo '</div>';
		}
		echo '</div>';
		echo '</div>';
	}
?>
